results/out/jetty.ring-middleware.async.java17.ParallelGC.r50k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 7.568ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 7.451ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 7.261ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 50.231ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 7.440ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 7.331ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 7.111ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 7.304ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 26.928ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 11.424ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 28.900ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 18.860ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 45.874ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 3.018ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.681ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 7.290ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.69ms   16.98ms   1.01s    99.86%
    Req/Sec     3.27k   686.48    12.20k    78.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.68ms
 75.000%    2.91ms
 90.000%    4.50ms
 99.000%    9.71ms
 99.900%   37.44ms
 99.990%  887.29ms
 99.999%  991.74ms
100.000%    1.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            1         1.00
       0.586     0.100000      2950377         1.11
       0.872     0.200000      5899690         1.25
       1.128     0.300000      8855017         1.43
       1.388     0.400000     11797597         1.67
       1.685     0.500000     14751284         2.00
       1.861     0.550000     16224476         2.22
       2.065     0.600000     17698729         2.50
       2.305     0.650000     19172878         2.86
       2.583     0.700000     20651054         3.33
       2.909     0.750000     22123106         4.00
       3.095     0.775000     22860629         4.44
       3.301     0.800000     23599780         5.00
       3.527     0.825000     24333108         5.71
       3.787     0.850000     25070766         6.67
       4.099     0.875000     25810203         8.00
       4.287     0.887500     26182876         8.89
       4.499     0.900000     26549192        10.00
       4.755     0.912500     26916761        11.43
       5.071     0.925000     27285860        13.33
       5.471     0.937500     27651850        16.00
       5.719     0.943750     27835953        17.78
       6.007     0.950000     28019724        20.00
       6.347     0.956250     28205326        22.86
       6.723     0.962500     28388924        26.67
       7.139     0.968750     28572783        32.00
       7.371     0.971875     28665031        35.56
       7.571     0.975000     28758107        40.00
       7.815     0.978125     28849797        45.71
       8.099     0.981250     28941127        53.33
       8.479     0.984375     29033570        64.00
       8.727     0.985938     29079370        71.11
       9.031     0.987500     29125692        80.00
       9.431     0.989062     29171664        91.43
       9.927     0.990625     29217880       106.67
      10.527     0.992188     29263709       128.00
      10.879     0.992969     29286691       142.22
      11.263     0.993750     29309683       160.00
      11.631     0.994531     29332520       182.86
      12.135     0.995313     29355677       213.33
      12.831     0.996094     29378645       256.00
      13.263     0.996484     29390104       284.44
      13.807     0.996875     29401640       320.00
      14.447     0.997266     29413131       365.71
      15.183     0.997656     29424691       426.67
      16.063     0.998047     29436143       512.00
      16.927     0.998242     29441908       568.89
      18.399     0.998437     29447675       640.00
      20.511     0.998633     29453414       731.43
      25.791     0.998828     29459167       853.33
      39.199     0.999023     29464926      1024.00
      49.311     0.999121     29467801      1137.78
      93.183     0.999219     29470681      1280.00
     197.887     0.999316     29473560      1462.86
     313.343     0.999414     29476440      1706.67
     430.591     0.999512     29479325      2048.00
     485.631     0.999561     29480761      2275.56
     543.743     0.999609     29482219      2560.00
     600.575     0.999658     29483643      2925.71
     657.919     0.999707     29485092      3413.33
     716.799     0.999756     29486522      4096.00
     744.447     0.999780     29487242      4551.11
     773.631     0.999805     29487961      5120.00
     802.303     0.999829     29488684      5851.43
     831.999     0.999854     29489416      6826.67
     860.159     0.999878     29490129      8192.00
     875.007     0.999890     29490491      9102.22
     889.343     0.999902     29490851     10240.00
     903.167     0.999915     29491203     11702.86
     917.503     0.999927     29491567     13653.33
     931.327     0.999939     29491923     16384.00
     939.007     0.999945     29492104     18204.44
     946.175     0.999951     29492282     20480.00
     952.831     0.999957     29492465     23405.71
     959.999     0.999963     29492656     27306.67
     968.191     0.999969     29492834     32768.00
     971.775     0.999973     29492912     36408.89
     975.359     0.999976     29493005     40960.00
     978.943     0.999979     29493095     46811.43
     982.015     0.999982     29493183     54613.33
     985.087     0.999985     29493280     65536.00
     987.647     0.999986     29493325     72817.78
     989.183     0.999988     29493369     81920.00
     990.719     0.999989     29493410     93622.86
     992.767     0.999991     29493467    109226.67
     994.303     0.999992     29493497    131072.00
     995.327     0.999993     29493532    145635.56
     995.839     0.999994     29493541    163840.00
     996.863     0.999995     29493575    187245.71
     997.887     0.999995     29493593    218453.33
     998.911     0.999996     29493620    262144.00
     998.911     0.999997     29493620    291271.11
     999.423     0.999997     29493632    327680.00
     999.935     0.999997     29493648    374491.43
    1000.447     0.999998     29493662    436906.67
    1000.959     0.999998     29493671    524288.00
    1000.959     0.999998     29493671    582542.22
    1001.471     0.999998     29493680    655360.00
    1001.983     0.999999     29493682    748982.86
    1002.495     0.999999     29493689    873813.33
    1003.007     0.999999     29493697   1048576.00
    1003.007     0.999999     29493697   1165084.44
    1003.519     0.999999     29493701   1310720.00
    1004.031     0.999999     29493709   1497965.71
    1004.031     0.999999     29493709   1747626.67
    1004.031     1.000000     29493709   2097152.00
    1004.031     1.000000     29493709   2330168.89
    1004.543     1.000000     29493714   2621440.00
    1004.543     1.000000     29493714   2995931.43
    1004.543     1.000000     29493714   3495253.33
    1004.543     1.000000     29493714   4194304.00
    1005.055     1.000000     29493715   4660337.78
    1005.567     1.000000     29493720   5242880.00
    1005.567     1.000000     29493720   5991862.86
    1005.567     1.000000     29493720   6990506.67
    1005.567     1.000000     29493720   8388608.00
    1005.567     1.000000     29493720   9320675.55
    1005.567     1.000000     29493720  10485760.00
    1005.567     1.000000     29493720  11983725.71
    1005.567     1.000000     29493720  13981013.34
    1005.567     1.000000     29493720  16777216.00
    1005.567     1.000000     29493720  18641351.10
    1005.567     1.000000     29493720  20971519.98
    1005.567     1.000000     29493720  23967451.45
    1005.567     1.000000     29493720  27962026.68
    1007.103     1.000000     29493721  33554432.00
    1007.103     1.000000     29493721          inf
#[Mean    =        2.685, StdDeviation   =       16.978]
#[Max     =     1006.592, Total count    =     29493721]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29993843 requests in 10.00m, 4.64GB read
Requests/sec:  49989.82
Transfer/sec:      7.91MB